app/Models/AdministrasiModel.php

    public function getAdministrasiCount()
    {
        return $this->select('*')
            ->where(['administrasi_status' => 'Menunggu Konfirmasi'])
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `administrasi`
WHERE `administrasi_status` = 'Menunggu Konfirmasi'