app/Models/PelaporanModel.php

SELECT COUNT(*) AS `numrows`
FROM `pelaporan`
WHERE `status_pelaporan` = 'Menunggu Konfirmasi'
---
    public function getPelaporanCount()
    {
        return $this->select('*')
            ->where(['status_pelaporan' => 'Menunggu Konfirmasi'])
            ->countAllResults();