app/Models/PesanModel.php

    public function countPesan()
    {
        return $this->where(['status' => 'Belum Dibaca'])->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `pesan`
WHERE `status` = 'Belum Dibaca'